<template>
  <div class="container">
    <p>
      درخواست عودت کالا و یا مرجوع کردن کالاها به دلیل انصراف از خرید تنها در
      صورت پلمپ بودن کالا (کالا نباید باز شده باشد ) امکانپذیر است امکان برگشت
      کالا در گروه موبایل با دلیل "انصراف از خرید" تنها در صورتی مورد قبول است
      که پلمب کالا باز نشده باشد. تمام گوشی‌های دیجی‌کالا ضمانت رجیستری دارند.
      در صورت وجود مشکل رجیستری، می‌توانید بعد از مهلت قانونی ۳۰ روزه، گوشی
      خریداری‌شده را مرجوع کنید. درخواست عودت کالا و یا مرجوع کردن کالاها به
      دلیل انصراف از خرید تنها در صورت پلمپ بودن کالا (کالا نباید باز شده باشد )
      امکانپذیر است امکان برگشت کالا در گروه موبایل با دلیل "انصراف از خرید"
      تنها در صورتی مورد قبول است که پلمب کالا باز نشده باشد. تمام گوشی‌های
      دیجی‌کالا ضمانت رجیستری دارند. در صورت وجود مشکل رجیستری، می‌توانید بعد از
      مهلت قانونی ۳۰ روزه، گوشی خریداری‌شده را مرجوع کنید. درخواست عودت کالا و
      یا مرجوع کردن کالاها به دلیل انصراف از خرید تنها در صورت پلمپ بودن کالا
      (کالا نباید باز شده باشد ) امکانپذیر است امکان برگشت کالا در گروه موبایل
      با دلیل "انصراف از خرید" تنها در صورتی مورد قبول است که پلمب کالا باز نشده
      باشد. تمام گوشی‌های دیجی‌کالا ضمانت رجیستری دارند. در صورت وجود مشکل
      رجیستری، می‌توانید بعد از مهلت قانونی ۳۰ روزه، گوشی خریداری‌شده را مرجوع
      کنید. درخواست عودت کالا و یا مرجوع کردن کالاها به دلیل انصراف از خرید تنها
      در صورت پلمپ بودن کالا (کالا نباید باز شده باشد ) امکانپذیر است امکان
      برگشت کالا در گروه موبایل با دلیل "انصراف از خرید" تنها در صورتی مورد قبول
      است که پلمب کالا باز نشده باشد. تمام گوشی‌های دیجی‌کالا ضمانت رجیستری
      دارند. در صورت وجود مشکل رجیستری، می‌توانید بعد از مهلت قانونی ۳۰ روزه،
      گوشی خریداری‌شده را مرجوع کنید. درخواست عودت کالا و یا مرجوع کردن کالاها
      به دلیل انصراف از خرید تنها در صورت پلمپ بودن کالا (کالا نباید باز شده
      باشد ) امکانپذیر است امکان برگشت کالا در گروه موبایل با دلیل "انصراف از
      خرید" تنها در صورتی مورد قبول است که پلمب کالا باز نشده باشد. تمام
      گوشی‌های دیجی‌کالا ضمانت رجیستری دارند. در صورت وجود مشکل رجیستری،
      می‌توانید بعد از مهلت قانونی ۳۰ روزه، گوشی خریداری‌شده را مرجوع کنید.
      درخواست عودت کالا و یا مرجوع کردن کالاها به دلیل انصراف از خرید تنها در
      صورت پلمپ بودن کالا (کالا نباید باز شده باشد ) امکانپذیر است امکان برگشت
      کالا در گروه موبایل با دلیل "انصراف از خرید" تنها در صورتی مورد قبول است
      که پلمب کالا باز نشده باشد. تمام گوشی‌های دیجی‌کالا ضمانت رجیستری دارند.
      در صورت وجود مشکل رجیستری، می‌توانید بعد از مهلت قانونی ۳۰ روزه، گوشی
      خریداری‌شده را مرجوع کنید.
    </p>
  </div>
</template>
<style scoped>
.container {
  width: 100%;
}
p {
  padding: 10px;
  padding-top: 60px;
  font-size: 18px;
  line-height: 38px;
  font-family: "iran-yekan-DemiBold";
}
@media (min-width: 768px) and (max-width: 1024px) {
  p {
    padding: 15px;
    padding-top: 40px;
    font-size: 14px;
    line-height: 32px;
  }
}

@media (max-width: 767px) {
  p {
    padding: 10px;
    font-size: 8px;
    line-height: 25px;
  }
}
</style>
