<template>
  <footer>
    <div class="container">
      <div class="info">
        <h3>نام و جریانات شرکت</h3>
        <div class="item">
          <svg
            width="25"
            height="25"
            viewBox="0 0 25 25"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M12.7949 23.35C6.86492 23.35 2.04492 18.53 2.04492 12.6C2.04492 6.66998 6.86492 1.84998 12.7949 1.84998C18.7249 1.84998 23.5449 6.66998 23.5449 12.6C23.5449 18.53 18.7249 23.35 12.7949 23.35ZM12.7949 3.34998C7.69492 3.34998 3.54492 7.49998 3.54492 12.6C3.54492 17.7 7.69492 21.85 12.7949 21.85C17.8949 21.85 22.0449 17.7 22.0449 12.6C22.0449 7.49998 17.8949 3.34998 12.7949 3.34998Z"
              fill="#57626D"
            />
            <path
              d="M16.5046 16.53C16.3746 16.53 16.2446 16.5 16.1246 16.42L13.0246 14.57C12.2546 14.11 11.6846 13.1 11.6846 12.21V8.10999C11.6846 7.69999 12.0246 7.35999 12.4346 7.35999C12.8446 7.35999 13.1846 7.69999 13.1846 8.10999V12.21C13.1846 12.57 13.4846 13.1 13.7946 13.28L16.8946 15.13C17.2546 15.34 17.3646 15.8 17.1546 16.16C17.0046 16.4 16.7546 16.53 16.5046 16.53Z"
              fill="#57626D"
            />
          </svg>
          <span> شنبه تا 5 شنبه ساعت 1 تا 2</span>
        </div>
        <div class="item">
          <svg
            width="25"
            height="25"
            viewBox="0 0 25 25"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M12.7948 14.7699C10.6648 14.7699 8.9248 13.0399 8.9248 10.8999C8.9248 8.75992 10.6648 7.03992 12.7948 7.03992C14.9248 7.03992 16.6648 8.76992 16.6648 10.9099C16.6648 13.0499 14.9248 14.7699 12.7948 14.7699ZM12.7948 8.53992C11.4948 8.53992 10.4248 9.59992 10.4248 10.9099C10.4248 12.2199 11.4848 13.2799 12.7948 13.2799C14.1048 13.2799 15.1648 12.2199 15.1648 10.9099C15.1648 9.59992 14.0948 8.53992 12.7948 8.53992Z"
              fill="#57626D"
            />
            <path
              d="M12.7946 23.36C11.3146 23.36 9.82461 22.8 8.66461 21.69C5.71461 18.85 2.45461 14.32 3.68461 8.92998C4.79461 4.03998 9.06461 1.84998 12.7946 1.84998C12.7946 1.84998 12.7946 1.84998 12.8046 1.84998C16.5346 1.84998 20.8046 4.03998 21.9146 8.93998C23.1346 14.33 19.8746 18.85 16.9246 21.69C15.7646 22.8 14.2746 23.36 12.7946 23.36ZM12.7946 3.34998C9.88461 3.34998 6.14461 4.89998 5.15461 9.25998C4.07461 13.97 7.03461 18.03 9.71461 20.6C11.4446 22.27 14.1546 22.27 15.8846 20.6C18.5546 18.03 21.5146 13.97 20.4546 9.25998C19.4546 4.89998 15.7046 3.34998 12.7946 3.34998Z"
              fill="#57626D"
            />
          </svg>

          <span> استان فارس ، شهعرستان شیراز ، شهرک کوثر ، رحمت ، کوچه (کاکتوس) ، کوچه (نرگس) پلاک 0و طبثه 1 و کد پستی 7158681439</span>
        </div>
        <div class="item">
          <svg
            width="25"
            height="25"
            viewBox="0 0 25 25"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M18.2449 23.35C17.1149 23.35 15.9249 23.08 14.6949 22.56C13.4949 22.05 12.2849 21.35 11.1049 20.5C9.93492 19.64 8.80492 18.68 7.73492 17.63C6.67492 16.56 5.71492 15.43 4.86492 14.27C4.00492 13.07 3.31492 11.87 2.82492 10.71C2.30492 9.46998 2.04492 8.26998 2.04492 7.13998C2.04492 6.35998 2.18492 5.61998 2.45492 4.92998C2.73492 4.21998 3.18492 3.55998 3.79492 2.98998C4.56492 2.22998 5.44492 1.84998 6.38492 1.84998C6.77492 1.84998 7.17492 1.93998 7.51492 2.09998C7.90492 2.27998 8.23492 2.54998 8.47492 2.90998L10.7949 6.17998C11.0049 6.46998 11.1649 6.74998 11.2749 7.02998C11.4049 7.32998 11.4749 7.62998 11.4749 7.91998C11.4749 8.29998 11.3649 8.66998 11.1549 9.01998C11.0049 9.28998 10.7749 9.57998 10.4849 9.86998L9.80492 10.58C9.81492 10.61 9.82492 10.63 9.83492 10.65C9.95492 10.86 10.1949 11.22 10.6549 11.76C11.1449 12.32 11.6049 12.83 12.0649 13.3C12.6549 13.88 13.1449 14.34 13.6049 14.72C14.1749 15.2 14.5449 15.44 14.7649 15.55L14.7449 15.6L15.4749 14.88C15.7849 14.57 16.0849 14.34 16.3749 14.19C16.9249 13.85 17.6249 13.79 18.3249 14.08C18.5849 14.19 18.8649 14.34 19.1649 14.55L22.4849 16.91C22.8549 17.16 23.1249 17.48 23.2849 17.86C23.4349 18.24 23.5049 18.59 23.5049 18.94C23.5049 19.42 23.3949 19.9 23.1849 20.35C22.9749 20.8 22.7149 21.19 22.3849 21.55C21.8149 22.18 21.1949 22.63 20.4749 22.92C19.7849 23.2 19.0349 23.35 18.2449 23.35ZM6.38492 3.34998C5.83492 3.34998 5.32492 3.58998 4.83492 4.06998C4.37492 4.49998 4.05492 4.96998 3.85492 5.47998C3.64492 5.99998 3.54492 6.54998 3.54492 7.13998C3.54492 8.06998 3.76492 9.07998 4.20492 10.12C4.65492 11.18 5.28492 12.28 6.08492 13.38C6.88492 14.48 7.79492 15.55 8.79492 16.56C9.79492 17.55 10.8749 18.47 11.9849 19.28C13.0649 20.07 14.1749 20.71 15.2749 21.17C16.9849 21.9 18.5849 22.07 19.9049 21.52C20.4149 21.31 20.8649 20.99 21.2749 20.53C21.5049 20.28 21.6849 20.01 21.8349 19.69C21.9549 19.44 22.0149 19.18 22.0149 18.92C22.0149 18.76 21.9849 18.6 21.9049 18.42C21.8749 18.36 21.8149 18.25 21.6249 18.12L18.3049 15.76C18.1049 15.62 17.9249 15.52 17.7549 15.45C17.5349 15.36 17.4449 15.27 17.1049 15.48C16.9049 15.58 16.7249 15.73 16.5249 15.93L15.7649 16.68C15.3749 17.06 14.7749 17.15 14.3149 16.98L14.0449 16.86C13.6349 16.64 13.1549 16.3 12.6249 15.85C12.1449 15.44 11.6249 14.96 10.9949 14.34C10.5049 13.84 10.0149 13.31 9.50492 12.72C9.03492 12.17 8.69492 11.7 8.48492 11.31L8.36492 11.01C8.30492 10.78 8.28492 10.65 8.28492 10.51C8.28492 10.15 8.41492 9.82998 8.66492 9.57998L9.41492 8.79998C9.61492 8.59998 9.76492 8.40998 9.86492 8.23998C9.94492 8.10998 9.97492 7.99998 9.97492 7.89998C9.97492 7.81998 9.94492 7.69998 9.89492 7.57998C9.82492 7.41998 9.71492 7.23998 9.57492 7.04998L7.25492 3.76998C7.15492 3.62998 7.03492 3.52998 6.88492 3.45998C6.72492 3.38998 6.55492 3.34998 6.38492 3.34998ZM14.7449 15.61L14.5849 16.29L14.8549 15.59C14.8049 15.58 14.7649 15.59 14.7449 15.61Z"
              fill="#57626D"
            />
            <path
              d="M19.2949 10.35C18.8849 10.35 18.5449 10.01 18.5449 9.59998C18.5449 9.23998 18.1849 8.48998 17.5849 7.84998C16.9949 7.21998 16.3449 6.84998 15.7949 6.84998C15.3849 6.84998 15.0449 6.50998 15.0449 6.09998C15.0449 5.68998 15.3849 5.34998 15.7949 5.34998C16.7649 5.34998 17.7849 5.86998 18.6749 6.81998C19.5049 7.70998 20.0449 8.79998 20.0449 9.59998C20.0449 10.01 19.7049 10.35 19.2949 10.35Z"
              fill="#57626D"
            />
            <path
              d="M22.7949 10.35C22.3849 10.35 22.0449 10.01 22.0449 9.59998C22.0449 6.14998 19.2449 3.34998 15.7949 3.34998C15.3849 3.34998 15.0449 3.00998 15.0449 2.59998C15.0449 2.18998 15.3849 1.84998 15.7949 1.84998C20.0649 1.84998 23.5449 5.32998 23.5449 9.59998C23.5449 10.01 23.2049 10.35 22.7949 10.35Z"
              fill="#57626D"
            />
          </svg>

          <span> +989026995994</span>
        </div>
        <div class="item">
          <svg
            width="25"
            height="25"
            viewBox="0 0 25 25"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M17.7949 21.8501H7.79492C4.14492 21.8501 2.04492 19.7501 2.04492 16.1001V9.1001C2.04492 5.4501 4.14492 3.3501 7.79492 3.3501H17.7949C21.4449 3.3501 23.5449 5.4501 23.5449 9.1001V16.1001C23.5449 19.7501 21.4449 21.8501 17.7949 21.8501ZM7.79492 4.8501C4.93492 4.8501 3.54492 6.2401 3.54492 9.1001V16.1001C3.54492 18.9601 4.93492 20.3501 7.79492 20.3501H17.7949C20.6549 20.3501 22.0449 18.9601 22.0449 16.1001V9.1001C22.0449 6.2401 20.6549 4.8501 17.7949 4.8501H7.79492Z"
              fill="#57626D"
            />
            <path
              d="M12.7947 13.4701C11.9547 13.4701 11.1047 13.2101 10.4547 12.6801L7.3247 10.1801C7.0047 9.92007 6.9447 9.45007 7.2047 9.13007C7.4647 8.81007 7.93471 8.75007 8.25471 9.01007L11.3847 11.5101C12.1447 12.1201 13.4347 12.1201 14.1947 11.5101L17.3247 9.01007C17.6447 8.75007 18.1247 8.80007 18.3747 9.13007C18.6347 9.45007 18.5847 9.93007 18.2547 10.1801L15.1247 12.6801C14.4847 13.2101 13.6347 13.4701 12.7947 13.4701Z"
              fill="#57626D"
            />
          </svg>

          <span>contact@gmail.com </span>
        </div>
        <div class="social">
          <img src="/social/icons8-whatsapp.svg" alt="" />
          <img src="/social/icons8-instagram.svg" alt="" />
          <img src="/social/icons8-telegram.svg" alt="" />
          <img src="/social/icons8-linkedin.svg" alt="" />
        </div>
      </div>
      <div class="cat" v-for="(category, index) in categories" :key="index">
        <h3 @click="toggleCategory(index)">
          {{ category.title }}
        </h3>
        <ul :class="['footer-links', { open: isOpen[index] }]">
          <li v-for="item in category.links" :key="item">{{ item }}</li>
        </ul>
      </div>

      <p class="submit">برای ثبت نام و خرید <a>اینجا</a> کلیک کنید</p>
    </div>
    <div class="subtitle">
      <div class="enamad">
        <img src="/social/enamad.png" alt="" width="260px" />
      </div>
      <div class="copyrite">
        <div><p>تمامی حقوق این سایت مطلعق است</p></div>
        <br />

        <div>
          <p>© 2024 <strong>Shawonetc3</strong> . All Rights Reserved</p>
          <a referrerpolicy='origin' target='_blank' href='https://trustseal.enamad.ir/?id=642960&Code=Qvay7Yhqx0g2B6KsraXZkiqdnSVyvrYW'><img referrerpolicy='origin' src='https://trustseal.enamad.ir/logo.aspx?id=642960&Code=Qvay7Yhqx0g2B6KsraXZkiqdnSVyvrYW' alt='' style='cursor:pointer' code='Qvay7Yhqx0g2B6KsraXZkiqdnSVyvrYW'></a>
        </div>
      </div>
    </div>
  </footer>
</template>

<script setup>
const categories = [
  {
    title: "دسته بندی ها ۱",
    links: ["ساختمانی ", "صنعتی ", "خاک ", "سنگ", "آهن آلات", "ابزار"],
  },
  {
    title: "دسته بندی ها ۲",
    links: ["ساختمانی ", "صنعتی ", "خاک ", "سنگ", "آهن آلات", "ابزار"],
  },
  {
    title: "دسته بندی ها ۳",
    links: ["ساختمانی ", "صنعتی ", "خاک ", "سنگ", "آهن آلات", "ابزار"],
  },
];
const isOpen = ref(Array(categories.length).fill(false));

const toggleCategory = (index) => {
  isOpen.value[index] = !isOpen.value[index];
};
</script>

<style scoped>
.container {
  width: 75%;
  margin: auto;
  display: flex;
  justify-content: space-between;
  align-items: flex-start;
  position: relative;
  border-bottom: #999999 1px solid;
  border-top: 1px solid rgba(0, 0, 0, 0.1);
  padding-top: 25px;
}
h3 {
  color: #253d4e;
  font-size: 18px;
  font-weight: 700;
}
span {
  color: #253d4e;
  font-size: 14px;
  font-weight: 400;
}
ul {
  list-style-type: none;
  margin-top: 5px;
}
li {
  color: #253d4e;
  font-size: 14px;
  font-weight: 400;
  margin: 5px 0;
}
.info .item {
  display: flex;
  align-items: center;
  justify-content: flex-start;
  margin: 7px 0;
}
.info .item svg {
  margin-left: 5px;
}
.social {
  margin-top: 35px;
  display: flex;
}
p {
  position: absolute;
  bottom: 0;
  left: 50%;
  transform: translate(-50%, -50%);
  font-size: 18px;
  color: #adadad;
  font-weight: 700;
}
p a {
  text-decoration: none;
  font-size: 18px;
  color: #fdc040;
  font-weight: 700;
}
.subtitle {
  width: 75%;
  margin: auto;
  display: flex;
  justify-content: space-between;
  align-items: center;
  position: relative;
}
.subtitle p {
  font-size: 13px;
}

.copyrite p {
  position: relative;
}
.copyrite {
  position: absolute;
  width: 50%;
  right: 35%;
  bottom: 10px;
  display: flex;
  align-items: center;
}
.footer-links {
  list-style: none;
  padding: 10px;
  margin: 0;
  display: none;
}
@media (min-width: 769px) {
  .footer-links {
    display: block;
  }
}
@media (max-width: 768px) {
  .container {
    flex-direction: column;
    align-items: center;
    padding: 15px 0;
  }
  .cat {
    cursor: pointer;
    margin: 8px 0;
    border: 1px solid rgba(0, 0, 0, 0.1);
    width: 80%;
    padding: 3px 0;
    border-radius: 3px;
  }

  .cat h3 {
    text-align: center;
    font-size: 10px;
  }
  .footer-links {
    opacity: 0;
    transition: 0.5s;
  }
  .footer-links li {
    font-size: 6px;
  }
  .footer-links.open {
    display: block;
    opacity: 1;
    transition: 0.5s;
  }

  .footer-heading {
    cursor: pointer;
    font-size: 16px;
  }
  .info {
    display: flex;
    flex-wrap: wrap;
  }
  .info h3 {
    margin-left: 100px;
    font-size: 10px;
  }
  .info .item {
    flex-basis: 50%;
    font-size: 8px;
    margin-top: 10px;
  }
  .info .item span {
    font-size: 8px;
  }
  .info .item svg {
    width: 12px;
    height: 12px;
  }
  .social {
    margin-top: 10px;
  }
  .social img {
    width: 18px;
    height: 18px;
    margin: 0 6px;
  }
  .submit {
    font-size: 10px;
    margin-top: 20px;
    width: 100%;
    bottom: -8px;
    text-align: center;
  }
  .submit a {
    font-size: 11px;
  }
  .copyrite {
    position: absolute;
    width: 100%;
    right: 0;
    bottom: -100px;
    justify-content: center;
  }
}
</style>
